# GetSpecificFittingAngleStatus Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings..::..GetSpecificFittingAngleStatus Method
DuctSettings Class See Also
---
Gets the status of given specific angle.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool GetSpecificFittingAngleStatus(
	double angle
)
```

Visual Basic
---
```text
Public Function GetSpecificFittingAngleStatus ( _
	angle As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool GetSpecificFittingAngleStatus(
	double angle
)
```

# ### Parameters
angle
    Type: System..::..Double The specific fitting angle (in degree) that must be one of 90, 60, 45, 30, 22.5 or 11.25 degrees.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees. |

# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace